Revit 2026 API

# IFCAnyHandle Class

---

A handle representing an item in an IFC file.

SystemObject Autodesk.Revit.DB.IFCIFCAnyHandle

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class IFCAnyHandle : IDisposable
```
```vb
Public Class IFCAnyHandle
	Implements IDisposable
```
```cpp
public ref class IFCAnyHandle : IDisposable
```
```fsharp
type IFCAnyHandle =
    class
        interface IDisposable
    end
```

The IFCAnyHandle type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | HasValue | Identifies if the handle is empty or contains a value. |
|  | Id | The integer identifier for the handle. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | StepId | The step id of the handle. Valid only for import. |
|  | TypeName | The name of the type of the handle. |

|  | Name | Description |
| --- | --- | --- |
|  | CreateAggregateAttribute | Creates an attribute that is an aggregate. TODO: Rename to createAggregateByRef |
|  | Delete | Deletes the handle. |
|  | Dispose | Releases all resources used by the IFCAnyHandle |
|  | Equals | Determines whether the specified Object is equal to the current Object. (Overrides ObjectEquals(Object)) |
|  | GetAttribute | Gets the attribute by name. |
|  | GetHashCode | Gets the integer value of the id as hash code (Overrides ObjectGetHashCode) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsSubTypeOf | Determines whether the instance is an instance of the specified instance type or a subtype of this instance type. |
|  | IsTypeOf | Determines whether the instance is an instance of exactly the specified instance type. |
|  | SetAttribute(String, IFCAnyHandle) | Sets the attribute value. |
|  | SetAttribute(String, IFCData) | Sets the attribute value. |
|  | SetAttribute(String, Boolean) | Sets the attribute value. |
|  | SetAttribute(String, IListIFCAnyHandle) |  |
|  | SetAttribute(String, IListBoolean) |  |
|  | SetAttribute(String, IListDouble) |  |
|  | SetAttribute(String, IListInt32) |  |
|  | SetAttribute(String, IListString) |  |
|  | SetAttribute(String, ISetIFCAnyHandle) |  |
|  | SetAttribute(String, ISetBoolean) |  |
|  | SetAttribute(String, ISetDouble) |  |
|  | SetAttribute(String, ISetInt32) |  |
|  | SetAttribute(String, ISetString) |  |
|  | SetAttribute(String, Double) | Sets the attribute value. |
|  | SetAttribute(String, Int32) | Sets the attribute value. |
|  | SetAttribute(String, String) | Sets the attribute value. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |
|  | UnsetAttribute | Unsets the attribute value. |

|  | Name | Description |
| --- | --- | --- |
|  | Equality(IFCAnyHandle, IFCAnyHandle) | Determines whether two IFCAnyHandles are the same. |
|  | Inequality(IFCAnyHandle, IFCAnyHandle) | Determines whether two IFCAnyHandles are different. |

Handles are used to populate each line item in an IFC file. Each handle is assigned a unique identifier (an integer) which can be seen in the file contents at the start of the line.

#### Reference

Autodesk.Revit.DB.IFC Namespace